//----------------------------------------------------------------------
//   THIS IS AUTOMATICALLY GENERATED CODE
//   Generated by Mentor Graphics' Register Assistant V4.3 (Build 2)
//----------------------------------------------------------------------
// Project         : output
// File            : registers.h
//----------------------------------------------------------------------
// Created by      : markca
// Creation Date   : 7/3/13 1:08 PM
//----------------------------------------------------------------------
// Title           : output
//
// Description     : 
//
//----------------------------------------------------------------------

#ifndef _REGISTERS_H
#define _REGISTERS_H

#include <stdint.h>


/************************ DEFINE ACCESS RIGHTS ************************/
#define __RO volatile const /* read-only permissions */
#define __WO volatile       /* write-only permissions */
#define __RW volatile       /* read/write permissions */


/********************** DEFINE READ/WRITE MACROS **********************/
#define OUTPUT_READ16(reg, mask, offset) \
     (((reg) & (mask)) >> (offset))
#define OUTPUT_WRITE16(reg, mask, offset, data) \
     (((reg) & ~(mask)) | (((uint16_t)data << (offset))));


/********************** DEFINE HIERARCHY LEVELS ***********************/
// UART_PL011 (Size: 0xFFD)
typedef struct
{
   // UARTDR
   __RW uint16_t   UARTDR;           /* 0x1:0x0     */
   // Padding
        uint16_t   pad0;             /* 0x3:0x2     */
   // UARTRSR_ECR
   __RW uint16_t   UARTRSR_ECR;      /* 0x5:0x04    */
   // Padding
        uint16_t   pad1[9];          /* 0x17:0x6    */
   // UARTFR
   __RO uint16_t   UARTFR;           /* 0x19:0x18   */
   // Padding
        uint16_t   pad2[3];          /* 0x1F:0x1A   */
   // UARTILPR
   __RW uint16_t   UARTILPR;         /* 0x21:0x20   */
   // Padding
        uint16_t   pad3;             /* 0x23:0x22   */
   // UARTIBRD
   __RW uint16_t   UARTIBRD;         /* 0x25:0x24   */
   // Padding
        uint16_t   pad4;             /* 0x27:0x26   */
   // UARTFBRD
   __RW uint16_t   UARTFBRD;         /* 0x29:0x28   */
   // Padding
        uint16_t   pad5;             /* 0x2B:0x2A   */
   // UARTLCR_H
   __RW uint16_t   UARTLCR_H;        /* 0x2D:0x2C   */
   // Padding
        uint16_t   pad6;             /* 0x2F:0x2E   */
   // UARTCR
   __RW uint16_t   UARTCR;           /* 0x31:0x30   */
   // Padding
        uint16_t   pad7;             /* 0x33:0x32   */
   // UARTIFLS
   __RW uint16_t   UARTIFLS;         /* 0x35:0x34   */
   // Padding
        uint16_t   pad8;             /* 0x37:0x36   */
   // UARTIMSC
   __RW uint16_t   UARTIMSC;         /* 0x39:0x38   */
   // Padding
        uint16_t   pad9;             /* 0x3B:0x3A   */
   // UARTRIS
   __RO uint16_t   UARTRIS;          /* 0x3D:0x3C   */
   // Padding
        uint16_t   pad10;            /* 0x3F:0x3E   */
   // UARTMIS
   __RO uint16_t   UARTMIS;          /* 0x41:0x40   */
   // Padding
        uint16_t   pad11;            /* 0x43:0x42   */
   // UARTICR
   __WO uint16_t   UARTICR;          /* 0x45:0x44   */
   // Padding
        uint16_t   pad12;            /* 0x47:0x46   */
   // UARTDMACR
   __RW uint16_t   UARTDMACR;        /* 0x49:0x48   */
   // Padding
        uint16_t   pad13[1995];      /* 0xFDF:0x4A  */
   // UARTPeriphID0
   __RO uint8_t    UARTPeriphID0;    /* 0xFE0:0xFE0 */
   // Padding
        uint8_t    pad14[3];         /* 0xFE3:0xFE1 */
   // UARTPeriphID1
   __RO uint8_t    UARTPeriphID1;    /* 0xFE4:0xFE4 */
   // Padding
        uint8_t    pad15[3];         /* 0xFE7:0xFE5 */
   // UARTPeriphID2
   __RO uint8_t    UARTPeriphID2;    /* 0xFE8:0xFE8 */
   // Padding
        uint8_t    pad16[3];         /* 0xFEB:0xFE9 */
   // UARTPeriphID3
   __RO uint8_t    UARTPeriphID3;    /* 0xFEC:0xFEC */
   // Padding
        uint8_t    pad17[3];         /* 0xFEF:0xFED */
   // UARTCellID0
   __RO uint8_t    UARTCellID0;      /* 0xFF0:0xFF0 */
   // Padding
        uint8_t    pad18[3];         /* 0xFF3:0xFF1 */
   // UARTCellID1
   __RO uint8_t    UARTCellID1;      /* 0xFF4:0xFF4 */
   // Padding
        uint8_t    pad19[3];         /* 0xFF7:0xFF5 */
   // UARTCellID2
   __RO uint8_t    UARTCellID2;      /* 0xFF8:0xFF8 */
   // Padding
        uint8_t    pad20[3];         /* 0xFFB:0xFF9 */
   // UARTCellID3
   __RO uint8_t    UARTCellID3;      /* 0xFFC:0xFFC */
} __RW UART_PL011_s, *UART_PL011_ptr;

// rgb_led (Size: 0xC)
typedef struct
{
   // RED_EN
   __RW uint32_t   RED_EN;      /* 0x3:0x0 */
   // GREEN_EN
   __RW uint32_t   GREEN_EN;    /* 0x7:0x4 */
   // BLUE_EN
   __RW uint32_t   BLUE_EN;     /* 0xB:0x8 */
} __RW rgb_led_s, *rgb_led_ptr;

// top (Size: 0x4000E00C)
typedef struct
{
   // flash
   __RW uint64_t       flash[16384];      /* 0x1FFFF:0x0           */
   // Padding
        uint64_t       pad0[67092480];    /* 0x1FFFFFFF:0x20000    */
   // sram
   __RW uint64_t       sram[16384];       /* 0x2001FFFF:0x20000000 */
   // Padding
        uint64_t       pad1[67098624];    /* 0x4000BFFF:0x20020000 */
   // uart
        UART_PL011_s   uart;              /* 0x4000CFFC:0x4000C000 */
   // Padding
        uint8_t        pad2[4099];        /* 0x4000DFFF:0x4000CFFD */
   // led
        rgb_led_s      led;               /* 0x4000E00B:0x4000E000 */
} __RW top_s, *top_ptr;



/************************* DECLARE TOP ADDRESS ************************/
#define TOP__BASE 0x0

/**************************** DEFINE FIELDS ***************************/

//--------------------------------------------------------------------
//  Register: UARTDR
//    
//    SW Access     : read-write
//    HW Access     : read-write
// 
//  Fields:
//       8  UARTDR_FE (SW:read-write, HW:read-write) 
